package javaTest.Test5;
/*
Необходимо написать программу, которая реализует схему производства и потребления ресурсов.

1. Есть N потоков, производящих ресурс. Каждый производитель производит 1 единицу ресурса в tN времени.

2. Производители помещают ресурсы на склад, размера S. Больше, чем S ресурсов, на складе хранить нельзя.

3. Есть M потоков, потребляющих ресурсы. Каждый потребитель забирает со склада 1 единицу ресурса в tM времени.

4. Если склад пустой, потоки-потребители ждут. Как только ресурсы появились, потоки сразу же начинают их потреблять.

5. Если склад переполнен, потоки-производители ждут, пока потребители освободят место.

6. Ресурс имеет уникальный идентификатор для отслеживания.

7. Производители и потребители также имеют идентификаторы (порядковые номера)

8. Писать в лог (консоль) сообщение: время, номер и тип (производитель/потребитель) потока, идентификатор ресурса, событие. Событие – одно из:

a. Ресурс произведен

b. Ресурс помещен на склад

c. Ресурс забран со склада

d. Ресурс потреблен
 */
public class Task {
    // todo написать программу


}
